Repository: jmichault/jmichault.github.io
Catalog: _locale/*/_posts/2020-12-22-instali_raspbian.md.po
Languages: eo

source: fr
eo: eo

source: fonto
eo: auto

source: installer raspbian
eo: instali raspbian

source: installer _raspbian_ sur le _Raspberry_
eo: instalu _raspbian_ sur la _Raspberry_

source: Nous allons écrire le système _raspbian_ sur la carte micro-SD, puis faire quelques configurations de base du système.
eo: Ni skribos la sistemon _raspbian_ al la mikro-SDa karto, tiam ni faros iujn bazajn sistemajn agordojn.

source: Préparer la carte micro-SD.
eo: prepari la mikro-SD-karton.

source: Dans cet exemple, j'ai choisi de préparer la carte micro-SD pour mon _raspberry pi 3_ depuis un PC sous linux debian, et en ligne de commande.
eo: En ĉi tiu ekzemplo, mi elektis prepari la mikro-SD-karton por mia _raspberry pi 3_ de Debian Linux-komputilo, kaj de la komandlinio.

source: Si ça ne correspond pas à vos souhaits, vous trouverez facilement d'autres méthodes sur internet, par exemple sur le site <https://howtoraspberrypi.com/>.
eo: Se ĉi tio ne respondas al viaj deziroj, vi facile trovos aliajn metodojn en la interreto, ekzemple en la retejo <https://howtoraspberrypi.com/>.

source: **récupérer la dernière version de _raspbian_ sur le site officiel :**
eo: **akiru la plej novan version de _raspbian_ de la oficiala retejo:**

source: ```bash wget http://raspberry-pi.fr/download/raspbian_latest.zip -O raspbian.zip unzip raspbian.zip ``` Notez le nom du fichier extrait du fichier zip.
eo: ```bash wget http://raspberry-pi.fr/download/raspbian_latest.zip -O raspbian.zip unzip raspbian.zip ``` Notu la nomon de la dosiero ĉerpita de la zip-dosiero.

source: **identifier les disques présents :**
eo: **identigu la ĉeestantajn diskojn:**

source: ```bash ls -lrt /dev/sd? ``` Notez le résultat de la commande. 3. **insérez la carte dans l'ordinateur**
eo: ```bash ls -lrt /dev/sd? ``` Notu la rezulton de la komando. 3. **enmetu la karton en la komputilon**

source: puis identifiez le chemin d'accès de la carte :
eo: tiam identigu la vojon de la karto:

source: ```bash ls -lrt /dev/sd? ``` c'est normalement la dernière ligne.
eo: ```bash ls -lrt /dev/sd? ``` ĉi tio estas kutime la lasta linio.

source: **ATTENTION** : bien vérifier que ce périphérique n'était pas présent avant \(voyez ce qui avait été affiché à l'étape 2\) **!!!**
eo: **AVERTO** : kontrolu, ke ĉi tiu aparato ne ĉeestis antaŭe \(vidu, kio montriĝis en paŝo 2\) **!!!**

source: **écrire l'image sur la carte**
eo: **skribu bildon al karto**

source: Exécutez la commande ci-dessous, en remplaçant _chemin\_raspbian_ par le nom noté à l'étape 1, et _chemin\_carte_ par le nom noté à l'étape 3.
eo: Rulu la suban komandon, anstataŭigante _vojo\_raspbian_ per la nomo notita en paŝo 1, kaj _vojo\_karto_ kun la nomo notita en paŝo 3.

source: ```bash sudo dd bs=1M if=chemin_raspbian of=chemin_carte status=progress conv=fsync ``` (durée : ~40 minutes)
eo: ```bash sudo dd bs=1M if=vojo_raspbian of=vojo_karto status=progress conv=fsync ``` (daŭro: ~40 minutoj)

source: ```bash sync eject chemin_carte ```
eo: ```bash sync eject vojo_karto ```

source: premier démarrage du _raspberry_
eo: unua komenco de _raspberry_

source: Connectez un clavier, une souris et un écran, mettez la carte micro-SD dans le _raspberry_.
eo: Konekti klavaron, muson kaj ekranon, enmeti mikro-SD-karton en _raspberry_.

source: Branchez l'alimentation du _raspberry_.
eo: Konekti la potencon al la _raspberry_.

source: Le _raspberry_ démarre, et l'utilitaire de configuration se lance. Laissez vous guider pour configurer le pays, le mot de passe, le réseau wifi.
eo: La _raspberry_ ekfunkciigas, kaj la agorda utileco startas. Lasu vin gvidi por agordi la landon, la pasvorton, la vifian reton.

source: Je vous conseille de donner une adresse IP fixe à votre _raspberry_. Vous pouvez le faire soit au niveau de votre serveur DHCP si vous en avez un, soit dans la configuration du _raspberry_.
eo: Mi konsilas al vi doni fiksan IP-adreson al via _raspberry_. Vi povas fari tion aŭ ĉe via DHCP-servilo, se vi havas, aŭ en la agordo de _raspberry_.

source: Pour le faire au niveau du _raspberry_, il suffit de modifier le fichier _/etc/dhcpcp.conf_, par exemple avec _nano_ :
eo: Por fari ĝin je la nivelo de _raspberry_, simple modifu la dosieron _/etc/dhcpcp.conf_, ekzemple per _nano_ :

source: Puis il faut modifier ou ajouter la configuration de l'interface qui vous intéresse (eth0 pour le réseau filaire, wlan0 pour le réseau wifi). Par exemple pour attribuer l'adresse IP 192.168.0.101 sur un réseau dont le routeur est 192.168.0.1 :
eo: Poste vi devas modifi aŭ aldoni la agordon de la interfaco, kiu interesas vin (eth0 por la kabligita reto, wlan0 por la vifia-reto). Ekzemple, por atribui la IP-adreson 192.168.0.101 al reto kies enkursigilo estas 192.168.0.1:

source: Vous pouvez également préciser les serveurs de nom (DNS).
eo: Vi ankaŭ povas specifi la nomajn servilojn (DNS).

source: si vous désirez accéder à distance à la ligne de commande, activez ssh :
eo: se vi volas aliri la komandlinion malproksime, aktivigu ssh:

source: Pour que le _raspberry_ reste à l'heure, installez ntp :
eo: Por teni la _raspberry_ ĝustatempe, instalu ntp:
