Repository: jmichault/jmichault.github.io
Catalog: _locale/*/_posts/2020-11-21-instali_domoticz.md.po
Languages: eo, fr

source: fr
eo: eo

source: homa
eo: auto

source: Installer domoticz.
eo: Instalu domoticz.

source: Voici un exemple d'installation domoticz sous raspbian.
eo: Jen ekzemplo de domoticz-instalado sub raspbian.

source: Nous commençons par créer un utilisateur dédié, puis nous installons domoticz:
eo: Ni komencas kreante dediĉitan uzanton, poste ni instalas domoticz:

source: Appuyez sur Entrée lorsque la présentation s'affiche ( _\<OK>_ est le seul choix).
eo: Premu Enter kiam la prezento montriĝas ( _\<OK>_ estas la sola elekto).

source: Choix des services: laissez _http_ et _https_ cochés, allez sur _OK_, appuyez sur Entrée.
eo: Elekto de servoj: lasu _http_ kaj _https_ markajn, iru al _OK_, premu Enter.

source: _«HTTP Port number:»_ laissez 8080, allez sur _OK_, appuyez sur Entrée.
eo: _«HTTP Port number:»_ forlasu 8080, iru al _OK_, premu Enter.

source: _«HTTPS Port number:»_ mettez 8443, allez à _OK_, Entrée.
eo: _«HTTPS Port number:»_ metu 8443, iru al _OK_, Enigu.

source: _«Installation Folder:»_ mettre _/home/domotiko/domoticz_, allez à _OK_, Entrée.
eo: _«Installation Folder:»_ metu _/home/domotiko/domoticz_ iru _OK_, eniga klavo.

source: _«Installation Complete!»_ , Entrée.
eo: _«Installation Complete!»_ , Eniru.

source: Maintenant, nous créons le service _«systemd»_ qui lancera domoticz:
eo: Nun ni kreas la servon _«systemd»_ , kiu lanĉos domoticz:

source: _domoticz_ est installé et accessible : * du pi: <http://localhost:8080> ou <https://localhost:8443> * du réseau: <http://adresse_IP_du_pi:8080> ou <https://adresse_IP_du_pi:8443>
eo: _domoticz_ estas instalita kaj alirebla: * de la pi: <http://localhost:8080> aŭ <https://localhost:8443> * de la reto: <http://adreso_IP_de_pi:8080> aŭ <https://adreso_IP_de_pi:8443>

source: un peu de configuration:
eo: iom da agordo:

source: aller à _«Setup --> Settings»_
eo: iru al _«Setup --> Settings»_

source: changer de langue, définir l'emplacement
eo: ŝanĝi lingvon, difini lokon

source: définir la sécurité: nom d'utilisateur et mot de passe
eo: difini sekurecon: uzantnomo kaj pasvorto

source: définir les "Réseaux locaux", exemple: _«127.0.0.\*;192.168.0.*»_
eo: difini la "Lokajn retojn", ekzemple: _«127.0.0.\*;192.168.0.*»_

source: Activer "Sauvegarde automatique"
eo: Aktivigi "Aŭtomatan konservadon"

source: Matériel/Périphériques: désactiver "Accepter de nouveaux appareils"
eo: Aparataro/Flankaparatoj: malaktivigi "Akcepti novajn aparatojn"

source: Cliquez sur "Appliquer les paramètres".
eo: Alklaku "Apliki parametrojn".

source: Nous devons maintenant ajouter le matériel.
eo: Nun ni bezonas aldoni la aparataron.

source: voir <https://www.domoticz.com/wiki/Getting_started>
eo: vidu <https://www.domoticz.com/wiki/Getting_started>

source: Pour plus de détails, voir <https://www.domoticz.com/wiki/Raspberry_Pi>
eo: Por pli da detaloj, vidu <https://www.domoticz.com/wiki/Raspberry_Pi>

source: eo
fr: fr

source: fonto
fr: auto

source: Instali domoticz.
fr: Installer domoticz.

source: Jen ekzemplo de domoticz-instalado sub raspbian.
fr: Voici un exemple d'installation domoticz sous raspbian.

source: Ni komencas kreante dediĉitan uzanton, tiam ni instalas domoticz:
fr: Nous commençons par créer un utilisateur dédié, puis nous installons domoticz:

source: Premu Enter kiam prezentas (\<OK> estas la sola elekto).
fr: Appuyez sur Entrée lorsque la présentation s'affiche (\<OK> est le seul choix).

source: Elekto de servoj: lasu http kaj https kontrolitajn, iru al OK, eniru.
fr: Choix des services: laissez http et https cochés, allez sur OK, appuyez sur Entrée.

source: _«HTTP Port number:»_ forlasu 8080, iru al OK, premu Enter.
fr: _«HTTP Port number:»_ laissez 8080, allez sur OK, appuyez sur Entrée.

source: _«HTTPS Port number:»_ metu 8443, iru al OK, enigu.
fr: _«HTTPS Port number:»_ mettez 8443, allez à OK, Entrée.

source: _«Installation Folder:»_ metu _/home/domoticz/domoticz_, iru al OK, eniru.
fr: _«Installation Folder:»_ mettre _/home/domoticz/domoticz_, allez à OK, Entrée.

source: _«Installation Complete!»_ , Eniru.
fr: _«Installation Complete!»_ , Entrée.

source: Nun ni kreas la _«systemd»_ servon, kiu lanĉos domoticz:
fr: Maintenant, nous créons le service _«systemd»_ qui lancera domoticz:

source: domoticz estas instalita kaj alirebla ĉe: * de la pi: <http://localhost:8080> aŭ <https://localhost:8443> * de la reto: <http://ip-adreso_de_la_pi:8080> aŭ <https://ip-adreso_de_la_pi:8443>
fr: domoticz est installé et accessible : * du pi: <http://localhost:8080> ou <https://localhost:8443> * du réseau: <http://adresse_IP_du_pi:8080> ou <https://adresse_IP_du_pi:8443>

source: iu agordo:
fr: un peu de configuration:

source: iru al _«Setup --> Settings»_
fr: aller à _«Setup --> Settings»_

source: ŝanĝi lingvon, agordi lokon
fr: changer de langue, définir l'emplacement

source: difinu sekurecon: uzantnomon kaj pasvorton
fr: définir la sécurité: nom d'utilisateur et mot de passe

source: difinu la "Lokajn Retojn", ekzemplo: _«127.0.0.\*;192.168.0.*»_
fr: définir la "Réseaux locaux", exemple: _«127.0.0.\*;192.168.0.*»_

source: aktivigu "Aŭtomatan Sekurkopion"
fr: Activer "Sauvegarde automatique"

source: Aparataro/Aparatoj: malaktivigu "Akcepti novajn Aparatojn"
fr: Matériel/Périphériques: désactiver "Accepter de nouveaux appareils"

source: alklaku "Apliki Agordojn".
fr: Cliquez sur "Appliquer les paramètres".

source: Nun ni devas aldoni la aparataron.
fr: Nous devons maintenant ajouter le matériel.

source: vidu <https://www.domoticz.com/wiki/Getting_started>
fr: voir <https://www.domoticz.com/wiki/Getting_started>

source: Por pli da detaloj, vidu <https://www.domoticz.com/wiki/Raspberry_Pi>
fr: Pour plus de détails, voir <https://www.domoticz.com/wiki/Raspberry_Pi>
