Repository: jmichault/jmichault.github.io
Catalog: _locale/*/_posts/2021-02-11-programi_cc2531.md.po
Languages: eo

source: fr
eo: eo

source: fonto
eo: auto

source: Programmer la clé _USB_ _CC2531_
eo: Programi la USB-ŝlosilon _CC2531_

source: installer le logiciel de programmation
eo: instali fulman programaron

source: télécharger le programme zigbee
eo: elŝutu la zigbee-programaron

source: Chargez la dernière version du coordonnateur zigbee sur ce site : <https://github.com/Koenkk/Z-Stack-firmware/raw/master/coordinator/Z-Stack_Home_1.2/bin/default/>, puis décompressez l'archive.
eo: Elŝutu la plej novan version de la zigbee-kunordiganto en ĉi tiu retejo: <https://github.com/Koenkk/Z-Stack-firmware/raw/master/coordinator/Z-Stack_Home_1.2/bin/default/>, tiam malzipigu la arkivon.

source: exemple pour la version _CC2531_DEFAULT_20201127.zip_ :
eo: ekzemplo por la versio _CC2531_DEFAULT_20201127.zip_ :

source: connecter la clé
eo: konekti la ŝlosilon

source: Connectez quatre lignes _Dupont_ femelle à femelle aux broches 35,36,38 et 39 du _raspberry_. ( La broche 2 se trouve dans l'angle du _raspberry_, voir le site <https://pinout.xyz/> pour se repérer)
eo: Konekti kvar liniojn _Dupont_ inajn al inaj al pingloj 35,36,38 kaj 39 de _raspberry_. ( Pinglo 2 estas en la angulo de _raspberry_, vidu la retejon <https://pinout.xyz/> por lokalizi)

source: Connectez ces lignes au gros connecteur du câble _CC_ :
eo: Konektu ĉi tiujn liniojn al la granda konektilo de la kablo _CC_ :

source: ![](/public/raspberry-cc.png "disposition _raspberry_ et _CC_")
eo: ![](/public/raspberry-cc.png "dispozicio _raspberry_ kaj _CC_")

source: | broche _GPIO_ | broche _CC_ | | ---------------------- | ------------ | | 39 ( _GND_ ) | 1 ( _GND_ ) | | 36 ( _wPi 27, BCM16_ ) | 3 ( _DC_ ) | | 38 ( _wPi 28, BCM20_ ) | 4 ( _DD_ ) | | 35 ( _wPi 24, BCM19_ ) | 7 ( _reset_ )|
eo: | pinglo _GPIO_ | pinglo _CC_ | | ---------------------- | ------------ | | 39 ( _GND_ ) | 1 ( _GND_ ) | | 36 ( _wPi 27, BCM16_ ) | 3 ( _DC_ ) | | 38 ( _wPi 28, BCM20_ ) | 4 ( _DD_ ) | | 35 ( _wPi 24, BCM19_ ) | 7 ( _reset_ )|

source: Puis connectez la nappe de l'adaptateur vers la clé (regardez la photo pour le sens de branchement), et insérez la clé dans un des ports _USB_ : ![](/public/Raspberry-CC2531.jpg " _raspberry_ et _CC_")
eo: Poste konektu la adaptilan kablon al la ŝlosilo (rigardu la foton pri la direkto de konekto), kaj enmetu la ŝlosilon en unu el la havenoj _USB_ : ![](/public/Raspberry-CC2531.jpg " _raspberry_ kaj _CC_")

source: faire la programmation
eo: faru la programadon

source: testez en exécutant ceci :
eo: provu per ĉi tio:

source: Ça doit retourner:
eo: Ĝi devas reveni:

source: Sauvegardez le contenu actuel de la clé :
eo: Konservu la nunan enhavon de la ŝlosilo:

source: Programmez le fichier _CC2531ZNP-Prod.hex_ dans la clé _CC2531_:
eo: Programu la dosieron _CC2531ZNP-Prod.hex_ en la ŝlosilo _CC2531_:

source: En cas de problème
eo: En kazo de problemo

source: Consultez [ le site de _flash_cc2531_](https://jmichault.github.io/flash_cc2531-dok/)
eo: Konsultu [ la retejon de _flash_cc2531_](https://jmichault.github.io/flash_cc2531-dok/)
