Repository: jmichault/jmichault.github.io
Catalog: _locale/*/_posts/2021-08-14-alexa.md.po
Languages: eo

source: fr
eo: eo

source: fonto
eo: auto

source: Il est possible de relier _Alexa_ et _Domoticz_.
eo: Eblas konekti _Alexa_ kaj _Domoticz_.

source: Pour celà, installez _habridge_, voir l'article : [Lien _Domoticz-Alexa_ : _ha-bridge_](2021-08-14-habridge.md)
eo: Por ĉi tio, instalu _habridge_, vidu artikolon: [ligilo _Domoticz-Alexa_ : _ha-bridge_](2021-08-14-habridge.md)

source: Paramétrez la connexion à alexa et à domoticz :
eo: Agordu la konekton al Alexa kaj domoticz:

source: se connecter sur l'interface : http://adresse_du_pi:8082
eo: konektu al la interfaco: http://Pi_adreso: 8082

source: onglet _«bridge control»_ :
eo: langeto _«bridge control»_ :

source: _name=_ ce qu'on veut.
eo: _name=_ Kion ni volas.

source: _IP_ = adresse du pi
eo: _IP_ = PI-adreso

source: cliquez sur _Add_.
eo: alklaku _Add_.

source: _Unique ID to use 9 Octets_ : cocher _true_.
eo: _Unique ID to use 9 Octets_ : kontrolu _true_.

source: Normalement le reste est configuré comme il faut. cliquez sur _«Save»_ . Rafraichir la page.
eo: Kutime la resto estas agordita konvene. Alklaku sur _“Save”_ . Refreŝigu la paĝon.

source: Choisissez les périphériques
eo: Elektu aparatojn

source: Allez dans l'onglet _«Domoticz Devices»_. Les périphériques doivent apparaître. Cliquez dans la case à cocher de ceux que vous voulez contrôler, puis cliquez sur _«Bulk Add»_.
eo: Iru al la langeto _«Domoticz Devices»_.Aparatoj devus aperi. Alklaku la markobutonon de tiuj, kiujn vi volas kontroli, tiam alklaku _"Bulk Add"_

source: Maintenant vous pouvez aller dans l'interface d'alexa _https://alexa.amazon.fr/_ , et ajouter les périphériques : «Maison connectée» --> Appareils --> Détecter. (Ou alors dites à _Alexa_ : «_Alexa_... Détecte mes appareils»)
eo: Nun vi povas iri al la interfaco _https://alexa.amazon.fr/_ , kaj aldonu la aparatojn: "konektita domo" -> aparatoj -> detektu.

source: Note : Pour ajouter une phrase de contrôle : aller dans l'application mobile _alexa_, et créer une routine.
eo: Noto: Por aldoni kontrolan frazon: iru al la poŝtelefona apliko _alexa_, kaj kreu rutinon.
