Repository: jmichault/jmichault.github.io
Catalog: _locale/*/_data/site-translations.yml.po
Languages: eo

source: Propulsé par
eo: Funkciigita de

source: Tous les messages
eo: Ĉiuj Afiŝoj

source: Choisissez votre langue
eo: Elektu vian lingvon

source: Lisez cette page dans une autre langue
eo: Legu ĉi tiun paĝon en alia lingvo

source: Quelques idées pour concevoir votre domotique à moindre coût.
eo: Iuj ideoj por projekti vian hejman aŭtomatigon je pli malalta kosto.

source: Licence <a rel="license" href="https://creativecommons.org/licenses/by-sa/4.0/"><img alt="Licence Creative Commons" style="display:inline;border-width:0" src="https://i.creativecommons.org/l/by-sa/4.0/88x31.png" title="CC-BY-SA 4.0" /></a>
eo: Permesilo <a rel="license" href="https://creativecommons.org/licenses/by-sa/4.0/"><img alt="Licence Creative Commons" style="display:inline;border-width:0" src="https://i.creativecommons.org/l/by-sa/4.0/88x31.png" title="CC-BY-SA 4.0"/></a>

source: Regarder dans
eo: Rigardi en

source: Articles Similaires
eo: Rilataj Afiŝoj

source: Recherche Google.
eo: Ŝercu per Google.

source: Domotique maison
eo: Hejma aŭtomatigo

source: Attention : cette page a été traduite automatiquement. Si vous le pouvez, vous devriez la lire dans l'une de ces langues :
eo: Bonvolu noti: ĉi tiu paĝo estis tradukita aŭtomate. Se vi povas, vi devas legi ĝin en unu el ĉi tiuj lingvoj:
