Repository: jmichault/jmichault.github.io
Catalog: _locale/*/komenci.md.po
Languages: eo, fr

source: fr
eo: eo

source: Pour débuter
eo: Por debuti

source: introduction
eo: enkonduko

source: Comme exemple de début, vous pouvez réaliser un système domotique fait maison avec un nano-ordinateur _raspberry Pi3 B+_, en l’équipant pour pouvoir gérer des équipements 433 Mhz et des équipements _zigbee_. J’ai choisi le logiciel libre domoticz pour gérer l’ensemble.
eo: Kiel ekzemplo de debuto, vi povas krei hejman aŭtomatan sistemon per nanokomputilo _raspberry Pi3 B+_, ekipante ĝin por povi administri 433 Mhz-ekipaĵojn kaj _zigbee_-ekipaĵojn. Mi elektis la liberan programon domoticz por administri ĉion.

source: **Le _raspberry Pi3 B+_ a pour avantages :**
eo: **La _raspberry Pi3 B+_ havas la jenajn avantaĝojn:**

source: son bas prix
eo: ĝia malalta prezo

source: une puissance de calcul trés confortable pour la domotique.
eo: tre komforta komputila potenco por hejma aŭtomatigo.

source: une consommation réduite.
eo: reduktita konsumo.

source: pas besoin de ventilateur.
eo: neniu ventolilo bezonis.

source: une connectivité fournie : un port éthernet, 4 ports USB, le Wifi, le Bluetooth, des ports GPIO.
eo: konektebleco provizita: ethernet-haveno, 4 USB-havenoj, Wifi, Bluetooth, GPIO-havenoj.

source: **L'intérêt du 433 Mhz est:**
eo: **La intereso de 433 Mhz estas:**

source: il est autorisé au niveau mondial depuis des décennies.
eo: ĝi estas rajtigita tutmonde de jardekoj.

source: de ce fait il existe du matériel très bon marché.
eo: tial ekzistas tre malmultekosta materialo.

source: Ses inconvénients sont:
eo: Ĝiaj malavantaĝoj estas:

source: il n’y a pas de protocole défini, chaque constructeur fait ce qu’il veut.
eo: ne estas difinita protokolo, ĉiu fabrikanto faras tion, kion li volas.

source: le protocole utilisé est rarement bidirectionnel.
eo: la uzata protokolo malofte estas dudirekta.

source: **L'intérêt du zigbee est:**
eo: **La intereso de zigbee estas:**

source: il a été conçu pour rendre possible la construction de modules bon marché, de ce fait les prix sont en train de baisser progressivement.
eo: estis dizajnite por fari ebla konstrui malmultekostajn modulojn, tiel ke prezoj iom post iom falas.

source: il utilise un protocole ouvert, sécurisé et bidirectionnel.
eo: ĝi uzas malferman, sekuran kaj dudirektan protokolon.

source: chaque module peut servir comme relais pour augmenter la portée.
eo: ĉiu modulo povas esti uzata kiel relajso por pliigi la sensodistancon.

source: il utilise une gamme de fréquence internationale et permettant de gérer un grand nombre de modules.
eo: ĝi uzas internacian frekvencan gamon kaj ebligas administri grandan nombron da moduloj.

source: il a été choisi par de grandes marques telles que _Philips_ (système _HUE_), Ikea (système _TRÅDFRI_), Legrand, Xiaomi, et bien d'autres ...
eo: ĝi estis elektista per grandaj markoj kiel _Philips_ (sistemo _HUE_), Ikea (sistemo _TRÅDFRI_), Legrand, Xiaomi, kaj multaj aliaj ...

source: Les étapes :
eo: Paŝoj:

source: [obtenir le matériel](_posts/2020-08-31-aparataro.md)
eo: [akiru aparataron](_posts/2020-08-31-aparataro.md)

source: [installer _raspbian_](_posts/2020-12-22-instali_raspbian.md)
eo: [instali _raspbian_](_posts/2020-12-22-instali_raspbian.md)

source: programmer la clé USB _CC2531_ avec le coordinateur zigbee : [ le site de _flash_cc2531_](https://jmichault.github.io/flash_cc2531-dok/)
eo: programu la USB-ŝlosilon _CC2531_ kun la zigbee-kunordiganto: [ la loko de _flash_cc2531_](https://jmichault.github.io/flash_cc2531-dok/)

source: construire une antenne pour 433 Mhz.
eo: konstruu antenon por 433 Mhz.

source: installer _domoticz_ : [domoticz.com](https://www.domoticz.com/wiki/Raspberry_Pi)
eo: instali _domoticz_ : [domoticz.com](https://www.domoticz.com/wiki/Raspberry_Pi)

source: installer _zigbee_ : [zigbee2mqtt.io](https://www.zigbee2mqtt.io/getting_started/running_zigbee2mqtt.html)
eo: instali _zigbee_ : [zigbee2mqtt.io](https://www.zigbee2mqtt.io/getting_started/running_zigbee2mqtt.html)

source: installez _rf_gpio_ : [github.com](https://github.com/jmichault/rf_gpio/blob/master/LeguMin.md)
eo: instali _rf_gpio_ : [github.com](https://github.com/jmichault/rf_gpio/blob/master/LeguMin.md)

source: Connectez vos premiers éléments:
eo: Konekti viajn unuajn elementojn:

source: connecter un thermomètre _433Mhz_
eo: konekti termometron _433Mhz_

source: connecter une prise _433Mhz_
eo: konekti ŝtopilon _433Mhz_

source: connecter une ampoule _zigbee_
eo: konekti ampolon _zigbee_

source: eo
fr: fr

source: Por komenci
fr: Pour débuter

source: Paŝoj por prepari hejman aŭtomatan sistemon :
fr: Étapes pour réaliser un système domotique maison :

source: [akiru la materialon](_posts/2020-08-31-aparataro.md)
fr: [obtenir le matériel](_posts/2020-08-31-aparataro.md)

source: instalu _raspbian_ : [raspberry.org](https://www.raspberrypi.org/documentation/installation/installing-images/README.md)
fr: installer _raspbian_ : [raspberry.org](https://www.raspberrypi.org/documentation/installation/installing-images/README.md)

source: programu la firmvaron de la USB-batono _CC2531_ : [github.com](https://github.com/jmichault/flash_cc2531)
fr: programmer le firmware de la clé USB _CC2531_ : [github.com](https://github.com/jmichault/flash_cc2531)

source: konstruu antenon
fr: construire une antenne

source: instalu _domoticz_ : [domoticz.com](https://www.domoticz.com/wiki/Raspberry_Pi)
fr: installer _domoticz_ : [domoticz.com](https://www.domoticz.com/wiki/Raspberry_Pi)

source: instalu _zigbee_ : [zigbee2mqtt.io](https://www.zigbee2mqtt.io/getting_started/running_zigbee2mqtt.html)
fr: installer _zigbee_ : [zigbee2mqtt.io](https://www.zigbee2mqtt.io/getting_started/running_zigbee2mqtt.html)

source: instalu _rf_gpio_ : [github.com](https://github.com/jmichault/rf_gpio/blob/master/LeguMin.md)
fr: installer _rf_gpio_ : [github.com](https://github.com/jmichault/rf_gpio/blob/master/LeguMin.md)

source: malpermesu _sudo_ sen pasvorto
fr: interdire _sudo_ sans mot de passe

source: instalu sekurkopion : [borgbackup.readthedocs.io](https://borgbackup.readthedocs.io/en/stable/installation.html)
fr: installer la sauvegarde: [borgbackup.readthedocs.io](https://borgbackup.readthedocs.io/en/stable/installation.html)

source: Konektu viajn unuajn elementojn:
fr: Connectez vos premiers éléments:

source: konektu termometron
fr: connecter un thermomètre

source: konektu ingon
fr: connecter une prise

source: konektu ampolon
fr: connecter une ampoule
